example='Топинамбур'
print(example[0])
print(example[-1])
print(example[5:])
print(example[::-1])
print(example[1::2])
# пробую на своем примере
example1='Компьютер'
#Выведите на экран(в консоль) первый символ этой строки
print(example1[0])
#Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
print(example1[-1])
#Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
print(example1[4:])
#Выведите на экран(в консоль) это слово наоборот.
print(example1[::-1])
#Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')
print(example1[1::2])